{
    "400": {
        "code": 400,
        "title": "Bad Request",
        "message": "The server couldn't process your request due to client error. Please check your input and try again."
    },
    "401": {
        "code": 401,
        "title": "Unauthorized",
        "message": "You are not authorized to access this resource. If you were previously logged in, your session may have expired. Please log in again to continue."
    },
    "403": {
        "code": 403,
        "title": "Access Denied",
        "message": "Your account doesn't have the necessary permissions to access this resource. Please check your user group membership."
    },
    "404": {
        "code": 404,
        "title": "Page Not Found",
        "message": "The page you are trying to access doesn't exist. Check the URL or contact the development team if you believe this is an error."
    },
    "408": {
        "code": 408,
        "title": "Request Timeout",
        "message": "The server timed out while waiting for your request."
    },
    "409": {
        "code": 409,
        "title": "Duplicate error",
        "message": "A conflict occurred because a resource with the same name already exists."
    },
    "410": {
        "code": 410,
        "title": "Resource Gone",
        "message": "The resource you're trying to access has been permanently removed. Contact the development team if you need further assistance."
    },
    "418": {
        "code": 418,
        "title": "I'm a Teapot",
        "message": "This server is a teapot, not a coffee maker. Please direct your request to a coffee-capable server."
    },
    "429": {
        "code": 429,
        "title": "Too Many Requests",
        "message": "You've made too many requests in a short time. Please wait before trying again."
    },
    "500": {
        "code": 500,
        "title": "Something bad has happened",
        "message": "API service encountered an issue and couldn't complete your request. Please try refreshing the page."
    },
    "502": {
        "code": 502,
        "title": "Bad Gateway",
        "message": "The server received an invalid response from an upstream server while processing your request. Please try again later or contact the development team if the issue persists."
    },
    "503": {
        "code": 503,
        "title": "Service unavailable",
        "message": "API service is either not responding or unreachable. Please ensure a proper connection to the API service."
    }
}
